// Вывести квадрат числа

Console.Write("Введите число, которое необходимо возвести в квадрат: ");
var a = Console.ReadLine();
Console.WriteLine(a + " в квадрате = " + Convert.ToDouble(a) * Convert.ToDouble(a));
