// Вывести квадрат числа

Console.Write("Введите число, которое необходимо возвести в квадрат: ");
Double a = Convert.ToDouble(Console.ReadLine());
Console.WriteLine(a + " в квадрате = " + a * a);
